// Задание условий
Console.Clear();
Console.Write("Введите число: ");
int num1 = 5;
int num2 = 2;
if ((num1 == 5) && (num2 == 2))
{
    Console.Write("Да");
}
else
{
    Console.Write("Нет");
}